# Enumerate workflow runs
PREFIX rdf:        <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX wfprov:     <http://purl.org/wf4ever/wfprov#>
PREFIX wfdesc:     <http://purl.org/wf4ever/wfdesc#>
select ?wf where
{
    ?wf rdf:type wfprov:WorkflowRun
}
LIMIT 10

<?xml version="1.0"?>
<sparql xmlns="http://www.w3.org/2005/sparql-results#">
  <head>
    <variable name="wf"/>
  </head>
  <results>
    <result>
      <binding name="wf"><uri>http://wings.isi.edu/opmexport/resource/Account/ACCOUNT1332778615941</uri></binding>
    </result>
    <result>
      <binding name="wf"><uri>http://wings.isi.edu/opmexport/resource/Account/ACCOUNT1332778606534</uri></binding>
    </result>
    <result>
      <binding name="wf"><uri>http://ns.taverna.org.uk/2011/run/479c9612-4862-4bcb-ad09-315b7b864260/</uri></binding>
    </result>
  </results>
</sparql>

# Enumerate processes for selected workflow run
PREFIX rdf:        <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX wfprov:     <http://purl.org/wf4ever/wfprov#>
PREFIX wfdesc:     <http://purl.org/wf4ever/wfdesc#>
select ?wfp where
{
    ?wfp wfprov:wasPartOfWorkflowRun <http://wings.isi.edu/opmexport/resource/Account/ACCOUNT1332778615941>
}
LIMIT 20

<?xml version="1.0"?>
<sparql xmlns="http://www.w3.org/2005/sparql-results#">
  <head>
    <variable name="wfp"/>
  </head>
  <results>
    <result>
      <binding name="wfp"><uri>http://wings.isi.edu/opmexport/resource/ProcessInstance/ALIGNEMENTRESULTMERGER1332778615941</uri></binding>
    </result>
    <result>
      <binding name="wfp"><uri>http://wings.isi.edu/opmexport/resource/ProcessInstance/ALIGNEMENTRESULTMERGER1332778615941</uri></binding>
    </result>
    <result>
      <binding name="wfp"><uri>http://wings.isi.edu/opmexport/resource/ProcessInstance/RESULTSORTERV21332778615941</uri></binding>
    </result>
    <result>
      <binding name="wfp"><uri>http://wings.isi.edu/opmexport/resource/ProcessInstance/RESULTSORTERV21332778615941</uri></binding>
    </result>
    <result>
      <binding name="wfp"><uri>http://wings.isi.edu/opmexport/resource/ProcessInstance/COMPARELIGANDBINDINGSITESV211332778615941</uri></binding>
    </result>
    <result>
      <binding name="wfp"><uri>http://wings.isi.edu/opmexport/resource/ProcessInstance/COMPARELIGANDBINDINGSITESV211332778615941</uri></binding>
    </result>
    <result>
      <binding name="wfp"><uri>http://wings.isi.edu/opmexport/resource/ProcessInstance/RAWINTERACTIONNETWORKMERGER1332778615941</uri></binding>
    </result>
    <result>
      <binding name="wfp"><uri>http://wings.isi.edu/opmexport/resource/ProcessInstance/RAWINTERACTIONNETWORKMERGER1332778615941</uri></binding>
    </result>
    <result>
      <binding name="wfp"><uri>http://wings.isi.edu/opmexport/resource/ProcessInstance/COMPARELIGANDBINDINGSITESV21332778615941</uri></binding>
    </result>
    <result>
      <binding name="wfp"><uri>http://wings.isi.edu/opmexport/resource/ProcessInstance/COMPARELIGANDBINDINGSITESV21332778615941</uri></binding>
    </result>
    <result>
      <binding name="wfp"><uri>http://wings.isi.edu/opmexport/resource/ProcessInstance/RESULTSORTERV211332778615941</uri></binding>
    </result>
    <result>
      <binding name="wfp"><uri>http://wings.isi.edu/opmexport/resource/ProcessInstance/RESULTSORTERV211332778615941</uri></binding>
    </result>
  </results>
</sparql>


# Locate other workflows that have processes using the same process template

PREFIX rdf:        <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX wfprov:     <http://purl.org/wf4ever/wfprov#>
PREFIX wfdesc:     <http://purl.org/wf4ever/wfdesc#>
select ?owf ?owfp ?wft where
{
    <http://wings.isi.edu/opmexport/resource/ProcessInstance/COMPARELIGANDBINDINGSITESV211332778615941>
        wfprov:describedByProcess ?wft .
    ?owfp wfprov:describedByProcess ?wft .
    ?owfp wfprov:wasPartOfWorkflowRun ?owf    
    FILTER (?owf != <http://wings.isi.edu/opmexport/resource/Account/ACCOUNT1332778615941>)
}
LIMIT 10

<?xml version="1.0"?>
<sparql xmlns="http://www.w3.org/2005/sparql-results#">
  <head>
    <variable name="owf"/>
    <variable name="owfp"/>
    <variable name="wft"/>
  </head>
  <results>
    <result>
      <binding name="owf"><uri>http://wings.isi.edu/opmexport/resource/Account/ACCOUNT1332778606534</uri></binding>
      <binding name="owfp"><uri>http://wings.isi.edu/opmexport/resource/ProcessInstance/COMPARELIGANDBINDINGSITESV211332778606534</uri></binding>
      <binding name="wft"><uri>http://wings.isi.edu/opmexport/resource/ProcessTemplate/ABSTRACTSUBWFLIGANDBINDINGSITESCOMPARISON_COMPARELIGANDBINDINGSITESV21</uri></binding>
    </result>
    <result>
      <binding name="owf"><uri>http://wings.isi.edu/opmexport/resource/Account/ACCOUNT1332778606534</uri></binding>
      <binding name="owfp"><uri>http://wings.isi.edu/opmexport/resource/ProcessInstance/COMPARELIGANDBINDINGSITESV211332778606534</uri></binding>
      <binding name="wft"><uri>http://wings.isi.edu/opmexport/resource/ProcessTemplate/ABSTRACTSUBWFLIGANDBINDINGSITESCOMPARISON_COMPARELIGANDBINDINGSITESV21</uri></binding>
    </result>
  </results>
</sparql>

This last result shows one other workflow with two processes that use the same ABSTRACTSUBWFLIGANDBINDINGSITESCOMPARISON_COMPARELIGANDBINDINGSITESV21 process template as the selected process inthe original workflow.





# Common prefixes

PREFIX rdf:        <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX rdfs:       <http://www.w3.org/2000/01/rdf-schema#>
PREFIX owl:        <http://www.w3.org/2002/07/owl#>
PREFIX xsd:        <http://www.w3.org/2001/XMLSchema#>
PREFIX xml:        <http://www.w3.org/XML/1998/namespace>
PREFIX ro:         <http://purl.org/wf4ever/ro#>
PREFIX wfprov:     <http://purl.org/wf4ever/wfprov#>
PREFIX wfdesc:     <http://purl.org/wf4ever/wfdesc#>
PREFIX rdfg:       <http://www.w3.org/2004/03/trix/rdfg-1/>
PREFIX ore:        <http://www.openarchives.org/ore/terms/>
PREFIX ao:         <http://purl.org/ao/>
PREFIX dcterms:    <http://purl.org/dc/terms/>
PREFIX foaf:       <http://xmlns.com/foaf/0.1/>

